{"_id":{"$oid":"5ef35d036d47ecabd2fba4d1"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"5ef35e0b6d47ecabd2fba4d2"},"Title":" Ricki and the Flash","Description":"Its been a roller-coaster ride for Ricki Rendazzo (Meryl Streep), a one-time wife and mother of three who left her family behind to follow her dreams of rock and roll stardom in California","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"description":"This Is a new description for the movie we just update for the purpuses of thsi exercise."}
{"_id":{"$oid":"5ef3617a6d47ecabd2fba4d3"},"Title":" Harry Potter","Description":"Throughout the series, Harry is described as having his father perpetually untidy black hair, his mothers bright green eyes, and a lightning bolt-shaped scar on his forehead. He is further described as small and skinny for his age with a thin face and knobbly knees, and he wears round eyeglasses.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"David Yates","Bio":"is  an American film director, producer, screenwriter and actor, known for his work on several genre films","Birth":"1955"},"ImagePath":"harryP.png","Featured":true}
{"_id":{"$oid":"5ef3622f6d47ecabd2fba4d4"},"Title":"The Mask","Description":" When timid bank clerk Stanley Ipkiss (Jim Carrey) discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Chuck Russell","Bio":"Charles Russell is an American film director, producer, screenwriter and actor, known for his work on several genre films","Birth":"1958"},"ImagePath":"theMask.png","Featured":true,"Bio":"This Is a new bio for the movie director Chuck Ruseel for the movie we just update for the purpuses of thsi exercise."}
{"_id":{"$oid":"5ef363116d47ecabd2fba4d5"},"Title":"Lord of the rings","Description":"The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed","Genre":{"Name":"fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds"},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson ONZ KNZM is a New Zealand film director, screenwriter, occasional actor and film producer. He is best known as the director, writer, and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkie","Birth":"1961"},"ImagePath":"Lord.png","Featured":true}
{"_id":{"$oid":"5ef364416d47ecabd2fba4d6"},"Title":"The Trip to Greece","Description":"When Odysseus left Troy it took him ten years to get back to his home in Ithaca. Steve and Rob have only six days on their own personal odyssey in THE TRIP TO GREECE. On the way they argue about tragedy and comedy, astronomy and biology, myth, history, democracy and the meaning of life","Genre":{"Name":"fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds"},"Director":{"Name":"Michael Winterbottom","Bio":"Michael Winterbottom a film director, screenwriter, occasional actor and film producer. He is best known as the director, writer, and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkie","Birth":"1959"},"ImagePath":"greece.png","Featured":true}
{"_id":{"$oid":"5ef364d46d47ecabd2fba4d7"},"Title":" Driveways","Description":"driveways is the story has of fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed,","Genre":{"Name":"fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds"},"Director":{"Name":"Andrew Ahn","Bio":"Michael WinAndrew Ahn is an American film director who has directed the feature films Spa Night and Drivewaysterbottom a film director, screenwriter, occasional actor and film producer. He is best known as the director, writer, and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkie","Birth":"1965"},"ImagePath":"drive.png","Featured":true}
{"_id":{"$oid":"5ef3714c6d47ecabd2fba4d8"},"Title":" Sorry We Missed You","Description":" Sorry We Missed is the story of fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed,","Genre":{"Name":"drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Ken Loach","Bio":"Kenneth Charles Loach is an English filmmaker. His socially critical directing style and socialist ideals are evident in his film treatment of social issues such as poverty, homelessness, and labour rights","Birth":"1936"},"ImagePath":"drive.png","Featured":true}
{"_id":{"$oid":"5ef371e16d47ecabd2fba4d9"},"Title":"The Way Back","Description":"Is modern cinema’s preeminent sports-drama director, a status he maintains with The Way Back, a conventional but deeply felt story about addiction, anger and the rough road of rehabilitation. Reuniting O’Conner with his The Accountant star, the film concerns Jack Cunningham (Ben Affleck), a former high-school basketball phenom who, in the wake of multiple familial losses, gets through his construction-work days and wayward nights with a perpetual drink in hand.","Genre":{"Name":"drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Gavin O'Connor","Bio":"Gavin O'Connor is an American film director, screenwriter, producer, playwright, and actor. He is best known for directing the films Miracle, Warrior, and The Accountan","Birth":"1964"},"ImagePath":"back.png","Featured":true}
{"_id":{"$oid":"5ef3727a6d47ecabd2fba4da"},"Title":"Lady Bird","Description":"Greta Gerwig made her solo feature directorial debut with this funny and piercing coming-of-age story, set in her hometown, Sacramento, Calif. Saoirse Ronan dazzles in the title role as a quietly rebellious high-school senior whose quests for love and popularity bring her long-simmering resentments toward her mother (Laurie Metcalf, magnificent) to a boil. .","Genre":{"Name":"drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Greta Gerwig","Bio":"Greta Celeste Gerwig is an American actress and filmmaker. She first garnered attention after working on and appearing in several mumblecore films","Birth":"1983"},"ImagePath":"lady.png","Featured":true}
